/*SW6306操作库 V0.0
/TKWTL 2024/07/06
*/
#ifndef __SW6306_H__
#define __SW6306_H__

#ifdef __cplusplus
extern C {
#endif

#include "stdint.h"
    
/******************************用户设置区开始**********************************/
/*包含自己的I2C驱动库*/
#include "main.h"

//允许库挂起以出让运行时间。该模式下，需要重复执行函数直到其返回1为止
#define SW6306_SUSPENDABLE

//外部库给出的I2C读写函数
#ifdef SW6306_SUSPENDABLE//允许挂起
    
#define SW6306_I2C_Transmit(addr,reg,pdata,len,pflag) ASYNC_I2C_Transmit(addr,reg,pdata,len,pflag)
#define SW6306_I2C_Receive(addr,reg,pdata,len,pflag) ASYNC_I2C_Receive(addr,reg,pdata,len,pflag)
    
    
#else//不允许挂起
    
    
    
#endif

//设置SW6306功率路径上的感测电阻值 (单位:mOhm)
#define SW_VBUS_RSHUNT                  5           //VBUS 电流路径上的感测电阻值
#define SW_BATT_RSHUNT                  5           //电池电流路径上的感测电阻值
    
//设置SW6306 NTC引脚上的电阻参数，用于计算温度
#define SW6306_NTC_B 3435

//输入输出最大功率设定，最大100W
#define SW6306_INPUT_POWER_MAX          60          //输入/充电功率
#define SW6306_OUTPUT_POWER_MAX         80          //输出/放电功率

/******************************用户设置区结束**********************************/

struct SW6306_StatusTypedef
{
    uint8_t online;                                                             //SW6306连接成功，表现为有设备响应0x3C的地址
    uint8_t initialized;                                                        //SW6306已初始化，当SW6306失去连接时自动回到未初始化状态
    uint8_t unlocked;                                                           //SW6306已解锁，此时可以对寄存器进行写入
    uint8_t sendbuf[2];                                                         //传输缓冲用变量
    uint8_t flag;                                                               //标识传输完成与传输状态用变量
    
/***************************寄存器内存镜像声明*********************************/
    //ADC读取数据区
    uint16_t vbus;                  //BUS电压
    uint16_t ibus;                  //BUS电流
    uint16_t vbat;                  //BAT电压
    uint16_t ibat;                  //BAT电流
    uint16_t tntc;                  //NTC温度（精度太低，不建议使用）
    uint16_t tchip;                 //芯片温度
    uint16_t vntc;                  //NTC电压
    //以上为原始数据，需要经过对应的Read()函数转换才有意义
    
    //状态寄存器区
    uint8_t vbus_chg;               //0x0E 充电电压状态
    uint8_t qcstat;                 //0x0F 充放电快充与种类指示
    uint8_t ibuslim_chg;            //0x10 充电时接口端实时限流值
    uint8_t ibatlim_chg;            //0x11 充电时电池端实时限流值
    uint8_t mode;                   //0x12 模式与状态指示
    uint8_t noload;                 //0x13 端口空载指示
    uint8_t display;                //0x14 LED与显示状态指示
    uint8_t fault0;                 //0x15 事件指示
    uint8_t sys_stat;               //0x18 系统状态指示
    uint8_t typec_stat;             //0x19 Type-C口状态
    uint8_t intc;                   //0x1A NTC电流挡位
    uint8_t typea_qcin;             //0x1C A口存在与快充电压挡位
    uint8_t port_stat;              //0x1D 端口状态指示
    uint8_t fault1;                 //0x2A 异常事件指示0
    uint8_t fault2;                 //0x2B 异常事件指示1
    uint8_t fault3;                 //0x2C 异常事件指示2
    uint8_t pomax;                  //0x51 最大输出功率
    uint8_t pimax;                  //0x52 最大输入功率
    uint16_t maxcap;                //0x86~0x87 库仑计最大容量
    uint32_t presentcap;            //0x88~0x8A 库伦计当前容量
    uint8_t capacity;               //0x99 显示电量
    uint8_t learn_stat;             //0xA2 容量学习状态指示
    
    //设置寄存器存档
    uint8_t pimax_set;              //0x45 最大输入功率
    uint8_t pomax_set;              //0x4F 最大输入功率
};

//SW6306 I2C 地址，为0x3C左移一位，最低位为0
#ifndef SW6306_I2C_ADDR
#define SW6306_I2C_ADDR                 0x78
#endif

/**************************SW6306 寄存器地址定义*******************************/
//命名规则：固定前缀(SW6306)_状态(ST)/控制(CT)寄存器(RG)_(功能描述)
#define SW6306_STRG_REV                 0x01U//版本号
#define SW6306_STRG_VBUS_CHG            0x0EU//充电电压状态
#define SW6306_STRG_QCSTAT              0x0FU//充放电快充与种类指示
#define SW6306_STRG_BUSILIM_CHG         0x10U//充电时接口端实时限流值
#define SW6306_STRG_BATILIM_CHG         0x11U//充电时电池端实时限流值
#define SW6306_STRG_MODE                0x12U//模式与状态指示
#define SW6306_STRG_NOLOAD              0x13U//端口空载指示
#define SW6306_STRG_DISPLAY             0x14U//LED与显示状态指示
#define SW6306_STRG_FAULT0              0x15U//事件指示
#define SW6306_STRG_SYS_STAT            0x18U//系统状态指示
#define SW6306_STRG_TYPEC               0x19U//Type-C口状态
#define SW6306_STRG_NTC_CURR            0x1AU//NTC电流指示
